simulations/icofoam_cases/3_wall_5_ceiling/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    wall
    {
        type            patch;
        physicalType    patch;
        nFaces          16650;
        startFace       258351;
    }
    surface
    {
        type            patch;
        physicalType    patch;
        nFaces          3600;
        startFace       275001;
    }
    main_outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          24;
        startFace       278601;
    }
    branch_inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          48;
        startFace       278625;
    }
    branch_outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          72;
        startFace       278673;
    }
    main_inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          48;
        startFace       278745;
    }
)

// ************************************************************************* //
